# 编写你自己的学校对象和课表数据！

def oeWeek(startWeek, endWeek, mode): return [i for i in range(
    startWeek, endWeek + 1) if (i + mode) % 2 == 0]  # 奇偶周的实现函数


def rgWeek(startWeek, endWeek): return [
    i for i in range(startWeek, endWeek + 1)]  # 范围周的实现函数


classes = [
    ["Machine Vision and Photogrammetry", "季顺平", "3区1-529", rgWeek(3, 13), 1, [2, 3, 4]],
    ["图像解译与模式识别", "贾永红", "3区1-602", rgWeek(3, 8), 1, [6, 7, 8]],
    ["自然辩证法概论", "吴恺", "3区附3-302", rgWeek(9, 16), 1, [6, 7]],

    ["新时代中国特色社会主义理论与实践研究", "刘钒", "3区1-701", rgWeek(1, 11), 2, [3, 4, 5]],
    ["人工智能在摄影测量与遥感中的应用", "李杰 王鑫", "3区1-326", rgWeek(1, 16), 2, [6, 7]],
    ["地理信息理论与技术", "李建松", "3区1-328", rgWeek(3, 13), 2, [11, 12, 13]],  

    ["时空数据科学与方法", "乐鹏", "3区1-505", rgWeek(3, 13), 3, [2, 3, 4]], 
    ["图像解译与模式识别", "贾永红", "3区1-602", rgWeek(3, 8), 3, [3, 4, 5]], 
    
    ["图像处理与分析", "李林宜", "3区附3-502", rgWeek(3, 13), 4, [3, 4, 5]], 
    
    ["高分辨率对地观测技术", "汪韬阳", "3区1-301", rgWeek(3, 13), 5, [11, 12, 13]],
]


class school:

    name = "WUT"               # 学校的名称

    classTime = [
        (8, 0),
        (8, 50),
        (9, 50),
        (10, 40),
        (11, 30),
        (14, 5),
        (14, 55),
        (15, 45),
        (16, 40),
        (17, 30),
        (18, 30),
        (19, 20),
        (20, 10),
        ]                             # 每节课的上课时间（如: 这 3 节课的上课时间分别是 上午 8:00、下午 2:10、晚上 8:20）

    classPeriod = 45           # 每一节课的时长分钟数（如: 50 分钟）

    starterDay = [2022, 9, 5]    # 开学第一周星期一的日期存储为年、月、日三项
